# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой
# грядке, причем кусты высажены только по окружности. Таким образом, у каждого
# куста есть ровно два соседних. Всего на грядке растет N кустов. Эти кусты
# обладают разной урожайностью, поэтому ко времени сбора на них выросло
# различное число ягод – на i-ом кусте выросло ai ягод. В этом фермерском
# хозяйстве внедрена система автоматического сбора черники. Эта система состоит
# из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за
# один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с
# этого куста и с двух соседних с ним. Напишите программу для нахождения
# максимального числа ягод, которое может собрать за один заход собирающий
# модуль, находясь перед некоторым кустом заданной во входном файле грядки.
from random import randint

n = int(input('Введите количестов кустов: '))
a = []
for i in range(n):
    x = randint(1, 10)
    a.append(x)
print(a)

max_sum = a[len(a) - 1] + a[0] + a[1]
for i in range(1, len(a)):
    temp_sum = a[(i - len(a) - 1)] + a[i - len(a)] + a[i + 1 - len(a)]
    if temp_sum > max_sum:
        max_sum = temp_sum
print(max_sum)