"""
Задание 1.

Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode (НО НЕ В БАЙТЫ!!!)
и также проверить тип и содержимое переменных.

*Попытайтесь получить кодовые точки без онлайн-конвертера!
без хардкода!

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции
"""


def unicode_word(lst):
    temp_lst = []
    for word in lst:
        temp_lst.append(word.encode('unicode_escape').decode())
    return temp_lst


list_word = ['разработка', 'сокет', 'декоратор']

res = unicode_word(list_word)
print(type(res[0]))
print(*res, sep='\n')
